testhound/alo/llir/octave/m480/M480PrintVisitor.cpp
#include <iostream>
using namespace std;

#include <OctaveNode.h>

#include "M480PrintVisitor.h"
#include "M480Instructions.h"
 
namespace Llir 
{
  M480PrintVisitor::M480PrintVisitor(ostream &o) : 
    OctavePrintVisitor(o),
    M480Visitor()
  {}

  M480PrintVisitor::~M480PrintVisitor()
  {}
  
  void
  M480PrintVisitor::visit(const M480AddwhInstruction &i)
  {
    printAlu2OpBranch(i, "addwh");
  }

  
  void
  M480PrintVisitor::visit(const M480JaddwhInstruction &i)
  {
    printAlu2OpBranch(i, "addwh");
    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480AddwlInstruction &i)
  {
    printAlu2OpBranch(i, "addwl");
  }
  
  void
  M480PrintVisitor::visit(const M480JaddwlInstruction &i)
  {
    printAlu2OpBranch(i, "addwl");
    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480AddwwInstruction &i)
  {
    printAlu2OpBranch(i, "addww");
  }

  void
  M480PrintVisitor::visit(const M480JaddwwInstruction &i)
  {
    printAlu2OpBranch(i, "addww");
    printNops(i.getNumDelaySlots());
  }


  void
  M480PrintVisitor::visit(const M480AddlInstruction &i)
  {
    printAlu2OpBranch(i, "addl");
  }

  void
  M480PrintVisitor::visit(const M480JaddlInstruction &i)
  {
    printAlu2OpBranch(i, "addl");
    printNops(i.getNumDelaySlots());
  }


  void
  M480PrintVisitor::visit(const M480SubwhInstruction &i)
  {
    printAlu2OpBranch(i, "subwh");
  }

  void
  M480PrintVisitor::visit(const M480JsubwhInstruction &i)
  {
    printAlu2OpBranch(i, "subwh");
    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480SubwlInstruction &i)
  {
    printAlu2OpBranch(i, "subwl");
  }

  void
  M480PrintVisitor::visit(const M480JsubwlInstruction &i)
  {
    printAlu2OpBranch(i, "subwl");
    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480SubwwInstruction &i)
  {
    printAlu2OpBranch(i, "subww");
  }
  
  void
  M480PrintVisitor::visit(const M480JsubwwInstruction &i)
  {
    printAlu2OpBranch(i, "subww");
    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480SublInstruction &i)
  {
    printAlu2OpBranch(i, "subl");
  }

  void
  M480PrintVisitor::visit(const M480JsublInstruction &i)
  {
    printAlu2OpBranch(i, "subl");
    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480AddwhiInstruction &i)
  {
    printAlu2OpBranch(i, "addwhi");
  }

  void
  M480PrintVisitor::visit(const M480JaddwhiInstruction &i)
  {
    printAlu2OpBranch(i, "addwhi");
    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480AddwliInstruction &i)
  {
    printAlu2OpBranch(i, "addwli");
  }
  
  void
  M480PrintVisitor::visit(const M480JaddwliInstruction &i)
  {
    printAlu2OpBranch(i, "addwli");
    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480AddwwiInstruction &i)
  {
    printAlu2OpBranch(i, "addwwi");
  }
  
  void
  M480PrintVisitor::visit(const M480JaddwwiInstruction &i)
  {
    printAlu2OpBranch(i, "addwwi");
    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480AddliInstruction &i)
  {
    printAlu2OpBranch(i, "addli");
  }

  void
  M480PrintVisitor::visit(const M480JaddliInstruction &i)
  {
    printAlu2OpBranch(i, "addli");
    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480SubwhiInstruction &i)
  {
    printAlu2OpBranch(i, "subwhi");
  }
  void
  M480PrintVisitor::visit(const M480JsubwhiInstruction &i)
  {
    printAlu2OpBranch(i, "subwhi");
    printNops(i.getNumDelaySlots());
  }


  void
  M480PrintVisitor::visit(const M480SubwliInstruction &i)
  {
    printAlu2OpBranch(i, "subwli");
  }


  void
  M480PrintVisitor::visit(const M480JsubwliInstruction &i)
  {
    printAlu2OpBranch(i, "subwli");
    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480SubwwiInstruction &i)
  {
    printAlu2OpBranch(i, "subwwi");
  }

  void
  M480PrintVisitor::visit(const M480JsubwwiInstruction &i)
  {
    printAlu2OpBranch(i, "subwwi");
    printNops(i.getNumDelaySlots());
  }


  void
  M480PrintVisitor::visit(const M480SubliInstruction &i)
  {
    printAlu2OpBranch(i, "subli");
  }
  
  void
  M480PrintVisitor::visit(const M480JsubliInstruction &i)
  {
    printAlu2OpBranch(i, "subli");
    printNops(i.getNumDelaySlots());
  }
  
  void
  M480PrintVisitor::visit(const M480FfsInstruction &i)
  {
    printAlu2OpFind(i, "ffs");
  }

  void
  M480PrintVisitor::visit(const M480FlsInstruction &i)
  {
    printAlu2OpFind(i, "fls");
  }

  void
  M480PrintVisitor::visit(const M480ParInstruction &i)
  {
    shared_ptr<const LlirOperand> src = i.getSrc1();
    shared_ptr<const Register> dst = i.getDst();

    getOutputStream() << "par ";
    src->accept(*this);
    getOutputStream() << " ";
    dst->accept(*this);
    getOutputStream() << " ";

    i.getAbcFlag()->accept(*this);
  }
  
  void
  M480PrintVisitor::visit(const M480AddInstruction &i)
  {
    printAlu3OpAbcMod(i,"add");
  }

  void
  M480PrintVisitor::visit(const M480AddiInstruction &i)
  {
    printAlu3OpAbcMod(i,"addi");
  }

  void
  M480PrintVisitor::visit(const M480Add4xInstruction &i)
  {
    printAlu3OpAbcMod(i,"add4x");
  }

  void
  M480PrintVisitor::visit(const M480AddcInstruction &i)
  {
    printAlu3OpAbcMod(i,"addc");
  }

  void
  M480PrintVisitor::visit(const M480AddciInstruction &i)
  {
    printAlu3OpAbcMod(i,"addci");
  }

  void
  M480PrintVisitor::visit(const M480SubInstruction &i)
  {
    printAlu3OpAbcMod(i,"sub");
  }

  void
  M480PrintVisitor::visit(const M480SubiInstruction &i)
  {
    printAlu3OpAbcMod(i,"subi");
  }

  void
  M480PrintVisitor::visit(const M480SubbInstruction &i)
  {
    printAlu3OpAbcMod(i,"subb");
  }

  void
  M480PrintVisitor::visit(const M480SubbiInstruction &i)
  {
    printAlu3OpAbcMod(i,"subbi");
  }

  void
  M480PrintVisitor::visit(const M480AndInstruction &i)
  {
    printAlu3OpAbcMod(i,"and");
  }

  void
  M480PrintVisitor::visit(const M480OrInstruction &i)
  {
    printAlu3OpAbcMod(i,"or");
  }

  void
  M480PrintVisitor::visit(const M480XorInstruction &i)
  {
    printAlu3OpAbcMod(i,"xor");
  }

  void
  M480PrintVisitor::visit(const M480MaxInstruction &i)
  {
    printAlu3OpAbcMod(i,"max");
  }

  void
  M480PrintVisitor::visit(const M480MinInstruction &i)
  {
    printAlu3OpAbcMod(i,"min");
  }
  
  void
  M480PrintVisitor::visit(const M480RandInstruction &i)
  {
    printAlu3OpAbc(i,"rand");
  }

  void
  M480PrintVisitor::visit(const M480RotlInstruction &i)
  {
    printAlu3OpAbc(i,"rotl");
  }

  void
  M480PrintVisitor::visit(const M480RotrInstruction &i)
  {
    printAlu3OpAbc(i,"rotr");
  }

  void
  M480PrintVisitor::visit(const M480ClrbInstruction &i)
  {
    printAlu3OpAbc(i,"clrb");
  }

  void
  M480PrintVisitor::visit(const M480SetbInstruction &i)
  {
    printAlu3OpAbc(i,"setb");
  }

  void
  M480PrintVisitor::visit(const M480ShftInstruction &i)
  {
    printAlu3OpAbc(i,"shft");
  }

  void
  M480PrintVisitor::visit(const M480ShftaInstruction &i)
  {
    printAlu3OpAbc(i,"shfta");
  }

  void
  M480PrintVisitor::visit(const M480ShlInstruction &i)
  {
    printAlu3OpAbc(i,"shl");
  }

  void
  M480PrintVisitor::visit(const M480ShrInstruction &i)
  {
    printAlu3OpAbc(i,"shr");
  }

  void
  M480PrintVisitor::visit(const M480ShraInstruction &i)
  {
    printAlu3OpAbc(i,"shra");
  }

  void
  M480PrintVisitor::visit(const M480RandiInstruction &i)
  {
    printAlu3OpAbc(i,"randi");
  }

  void
  M480PrintVisitor::visit(const M480RotliInstruction &i)
  {
    printAlu3OpAbc(i,"rotli");
  }

  void
  M480PrintVisitor::visit(const M480RotriInstruction &i)
  {
    printAlu3OpAbc(i,"rotri");
  }

  void
  M480PrintVisitor::visit(const M480SetbiInstruction &i)
  {
    printAlu3OpAbc(i,"setbi");
  }

  void
  M480PrintVisitor::visit(const M480ClrbiInstruction &i)
  {
    printAlu3OpAbc(i,"clrbi");
  }

  void
  M480PrintVisitor::visit(const M480ShliInstruction &i)
  {
    printAlu3OpAbc(i,"shli");
  }

  void
  M480PrintVisitor::visit(const M480ShriInstruction &i)
  {
    printAlu3OpAbc(i,"shri");
  }

  void
  M480PrintVisitor::visit(const M480ShraiInstruction &i)
  {
    printAlu3OpAbc(i,"shrai");
  }

  void
  M480PrintVisitor::visit(const M480MaxiInstruction &i)
  {
    printAlu3OpAbc(i,"maxi");
  }

  void
  M480PrintVisitor::visit(const M480MiniInstruction &i)
  {
    printAlu3OpAbc(i,"mini");
  }

  void
  M480PrintVisitor::visit(const M480AndiInstruction &i)
  {
    printAlu3OpAbc(i,"andi");
  }

  void
  M480PrintVisitor::visit(const M480OriInstruction &i)
  {
    printAlu3OpAbc(i,"ori");
  }

  void
  M480PrintVisitor::visit(const M480XoriInstruction &i)
  {
    printAlu3OpAbc(i,"xori");
  }
  
  void
  M480PrintVisitor::visit(const M480MulInstruction &i)
  {
    printAlu3OpSx(i,"mul");
  }

  void
  M480PrintVisitor::visit(const M480MulhInstruction &i)
  {
    printAlu3OpSx(i,"mulh");
  }

  void
  M480PrintVisitor::visit(const M480MuliInstruction &i)
  {
    printAlu3OpSx(i,"muli");
  }

  void
  M480PrintVisitor::visit(const M480MulhiInstruction &i)
  {
    printAlu3OpSx(i,"mulhi");
  }

  void
  M480PrintVisitor::visit(const M480AddneInstruction &i)
  {
    printAlu3Op(i, "addne");
  }

  void
  M480PrintVisitor::visit(const M480AddneiInstruction &i)
  {
    printAlu3Op(i, "addnei");
  }

  void
  M480PrintVisitor::visit(const M480ByteswInstruction &i)
  {
    getOutputStream() << "bytesw ";
    i.getSrc1()->accept(*this);
    getOutputStream() << " ";
    i.getDst()->accept(*this);
    getOutputStream() << " ";
    i.getB0()->accept(*this);
    getOutputStream() << " ";
    i.getB1()->accept(*this);
    getOutputStream() << " ";
    i.getB2()->accept(*this);
    getOutputStream() << " ";
    i.getB3()->accept(*this);
    getOutputStream() << " ";
    i.getAbcFlag()->accept(*this);
  }
  
  void
  M480PrintVisitor::visit(const M480BcdrInstruction &i)
  {
    printCondBranch(i,"bcdr");
  }

  void
  M480PrintVisitor::visit(const M480BcrInstruction &i)
  {
    printCondBranch(i,"bcr");
  }
  
  void
  M480PrintVisitor::visit(const M480JbcrInstruction &i)
  {
    printCondBranch(i,"bcr");
    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480JbcdrInstruction &i)
  {
    printCondBranch(i,"bcdr");
    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480BiInstruction &i)
  {
    getOutputStream() << "bi" << " ";

    i.getSrc1()->accept(*this); 
    getOutputStream() << " ";

    i.getDst()->accept(*this); 
    getOutputStream() << " ";

    i.getCdFlag()->accept(*this);
  }

  void
  M480PrintVisitor::visit(const M480JbiInstruction &i)
  {
    getOutputStream() << "bi" << " ";

    i.getSrc1()->accept(*this); 
    getOutputStream() << " ";

    i.getDst()->accept(*this); 
    getOutputStream() << " ";

    i.getCdFlag()->accept(*this);

    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480BrInstruction &i)
  {
    getOutputStream() << "br ";

    i.getSrc1()->accept(*this); 
    getOutputStream() << " ";

    i.getDst()->accept(*this);
  }
  
  void
  M480PrintVisitor::visit(const M480JtablebrInstruction &i)
  {
    getOutputStream() << "br ";

    i.getSrc1()->accept(*this); 

