testhound/alo/llir/octave/m480/M480PrintVisitor.cpp
    i.getSrcBitNum()->accept(*this);
    getOutputStream() << " ";

    i.getDst()->accept(*this);
    getOutputStream() << " ";

    i.getDstBitNum()->accept(*this);
    getOutputStream() << " ";

    i.getNumBits()->accept(*this);
    getOutputStream() << " ";

    i.getSignFlag()->accept(*this);
  }
  
  void
  M480PrintVisitor::visit(const M480CmovInstruction &i)
  {
    printCmov(i,"cmov");
  }

  void
  M480PrintVisitor::visit(const M480CmoviInstruction &i)
  {
    printCmov(i,"cmovi");
  }
  
  void
  M480PrintVisitor::visit(const M480DmapInstruction &i)
  {
    printDma(i,"dmap");
  }

  void
  M480PrintVisitor::visit(const M480DmasrInstruction &i)
  {
    printDma(i,"dmasr");
  }

  void
  M480PrintVisitor::visit(const M480Dmau0Instruction &i)
  {
    printDma(i,"dmau0");
  }

  void
  M480PrintVisitor::visit(const M480Dmau1Instruction &i)
  {
    printDma(i,"dmau1");
  }
  
  void
  M480PrintVisitor::visit(const M480LihInstruction &i)
  {
    printLoadImmediate(i,"lih");
  }

  void
  M480PrintVisitor::visit(const M480LilInstruction &i)
  {
    printLoadImmediate(i,"lil");
  }

  void
  M480PrintVisitor::visit(const M480LwihInstruction &i)
  {
    printLoadHalfword(i,"lwih");
  }

  void
  M480PrintVisitor::visit(const M480LwilInstruction &i)
  {
    printLoadHalfword(i,"lwil");
  }

  void
  M480PrintVisitor::visit(const M480LaihInstruction &i)
  {
    printLoadImmediate(i,"laih");
  }

  void
  M480PrintVisitor::visit(const M480LailInstruction &i)
  {
    printLoadImmediate(i,"lail");
  }

  void
  M480PrintVisitor::visit(const M480NopInstruction &i)
  {
    getOutputStream() << "nop";
  }

  void
  M480PrintVisitor::visit(const M480Hec5Instruction &i)
  {
    getOutputStream() << "hec5 ";
    i.getSrc1()->accept(*this);
    getOutputStream() << " ";
    i.getDst()->accept(*this);
    getOutputStream() << " ";
    i.getBytes()->accept(*this);
    getOutputStream() << " ";
    i.getCumeFlag()->accept(*this);

    shared_ptr<const LlirOperand> target = i.getBranchTarget();

    OpndNull null;
    if (*target != null) 
      getOutputStream() << "br = ";
    target->accept(*this);

  }

  void
  M480PrintVisitor::visit(const M480JHec5Instruction &i)
  {
    getOutputStream() << "hec5 ";
    i.getSrc1()->accept(*this);
    getOutputStream() << " ";
    i.getDst()->accept(*this);
    getOutputStream() << " ";
    i.getBytes()->accept(*this);
    getOutputStream() << " ";
    i.getCumeFlag()->accept(*this);

    shared_ptr<const LlirOperand> target = i.getBranchTarget();

    OpndNull null;
    if (*target != null) 
      getOutputStream() << "br = ";
    target->accept(*this);

    printNops(i.getNumDelaySlots());
  }

  void
  M480PrintVisitor::visit(const M480MvInstruction &i)
  {
    getOutputStream() << "mv ";
    i.getSrc()->accept(*this);
    getOutputStream() << " ";
    i.getDst()->accept(*this);
  }

  void
  M480PrintVisitor::visit(const M480MvhrInstruction &i)
  {
    getOutputStream() << "mvhr ";
    i.getSrc()->accept(*this);
    getOutputStream() << " ";
    i.getDst()->accept(*this);
    getOutputStream() << " ";
    i.getMvhFlag()->accept(*this);
  }

  void
  M480PrintVisitor::visit(const M480MvrhInstruction &i)
  {
    getOutputStream() << "mvrh ";
    i.getSrc()->accept(*this);
    getOutputStream() << " ";
    i.getDst()->accept(*this);
    getOutputStream() << " ";
    i.getMvhFlag()->accept(*this);
  }

  void
  M480PrintVisitor::visit(const M480UnlinkInstruction &i)
  {
    getOutputStream() << "unlink ";
    i.getRegs()->accept(*this);
  }
  
  void
  M480PrintVisitor::visit(const M480LinkInstruction &i)
  {
    printLink(i,"link");
  }

  void
  M480PrintVisitor::visit(const M480LinksInstruction &i)
  {
    printLink(i,"links");
  }
      
  void
  M480PrintVisitor::visit(const M480LinkspInstruction &i)
  {
    printLink(i,"link");
  }
      
  void
  M480PrintVisitor::visit(const M480LinksplInstruction &i)
  {
    printLink(i,"link");
  }
    
  void
  M480PrintVisitor::visit(const M480LinksrInstruction &i)
  {
    printLink(i,"link");
  }
      
  void
  M480PrintVisitor::visit(const M480LinksdInstruction &i)
  {
    printLink(i,"link");
  }
        
  void
  M480PrintVisitor::visit(const M480LinkccInstruction &i)
  {
    printLink(i,"link");
  }
          
  void
  M480PrintVisitor::visit(const M480LinkcclInstruction &i)
  {
    printLink(i,"link");
  }
          
  void
  M480PrintVisitor::visit(const M480LinksioInstruction &i)
  {
    printLink(i,"link");
  }
       
  void
  M480PrintVisitor::visit(const M480LmmInstruction &i)
  {
    printLoad(i,"lmm");
  }

  void
  M480PrintVisitor::visit(const M480LmmspInstruction &i)
  {
    printLoad(i,"lsp");
  }

  void
  M480PrintVisitor::visit(const M480LmmsplInstruction &i)
  {
    printLoad(i,"lsp");
  }

  void
  M480PrintVisitor::visit(const M480LmmsrInstruction &i)
  {
    printLoad(i,"lmm");
  }

  void
  M480PrintVisitor::visit(const M480LmmsdInstruction &i)
  {
    printLoad(i,"lmm");
  }

  void
  M480PrintVisitor::visit(const M480LmmccInstruction &i)
  {
    printLoad(i,"lmm");
  }

  void
  M480PrintVisitor::visit(const M480LmmcclInstruction &i)
  {
    printLoad(i,"lmm");
  }

  void
  M480PrintVisitor::visit(const M480LmmsiInstruction &i)
  {
    printLoad(i,"lmm");
  }

  void
  M480PrintVisitor::visit(const M480LmmsInstruction &i)
  {
    printLoad(i,"lmms");
  }


  void
  M480PrintVisitor::visit(const M480LspInstruction &i)
  {
    printLoad(i,"lsp");
  }
  
  void
  M480PrintVisitor::visit(const M480SmmInstruction &i)
  {
    printStore(i,"smm");
  }

  void
  M480PrintVisitor::visit(const M480SmmspInstruction &i)
  {
    printStore(i,"ssp");
  }

  void
  M480PrintVisitor::visit(const M480SmmsplInstruction &i)
  {
    printStore(i,"ssp");
  }

  void
  M480PrintVisitor::visit(const M480SmmsrInstruction &i)
  {
    printStore(i,"smm");
  }

  void
  M480PrintVisitor::visit(const M480SmmsdInstruction &i)
  {
    printStore(i,"smm");
  }

  void
  M480PrintVisitor::visit(const M480SmmccInstruction &i)
  {
    printStore(i,"smm");
  }

  void
  M480PrintVisitor::visit(const M480SmmcclInstruction &i)
  {
    printStore(i,"smm");
  }

  void
  M480PrintVisitor::visit(const M480SmmsiInstruction &i)
  {
    printStore(i,"smm");
  }


  void
  M480PrintVisitor::visit(const M480SmmsInstruction &i)
  {
    printStore(i,"smms");
  }

  void
  M480PrintVisitor::visit(const M480SspInstruction &i)
  {
    printStore(i,"ssp");
  }

  void
  M480PrintVisitor::printTssRc(const TssRcOpInstruction &i, const char *mnemonic)
  {
    getOutputStream() << mnemonic << " ";
    getOutputStream() << " ";
    i.getRsa()->accept(*this);
    getOutputStream() << " ";
    i.getTssFlags()->accept(*this);
  }

  void
  M480PrintVisitor::visit(const M480PutcInstruction &i)
  {
    getOutputStream() << "putc ";
    i.getRsa()->accept(*this);
    getOutputStream() << " ";
    i.getRsb()->accept(*this);
    getOutputStream() << " ";
    i.getTssFlags()->accept(*this);
  }

  void
  M480PrintVisitor::visit(const M480PutmInstruction &i)
  {
    getOutputStream() << "putm ";
    i.getRsa()->accept(*this);
    getOutputStream() << " ";
    i.getRsb()->accept(*this);
    getOutputStream() << " ";
    i.getTssFlags()->accept(*this);
  }

  void
  M480PrintVisitor::visit(const M480PutpInstruction &i)
  {
    getOutputStream() << "putp ";
    i.getRsa()->accept(*this);
    getOutputStream() << " ";
    i.getRsb()->accept(*this);
    getOutputStream() << " ";
    i.getTssFlags()->accept(*this);
  }

  void
  M480PrintVisitor::visit(const M480PutdInstruction &i)
  {
    getOutputStream() << "putd ";
    i.getRsa()->accept(*this);
    getOutputStream() << " ";
    i.getRsb()->accept(*this);
    getOutputStream() << " ";
    i.getTssFlags()->accept(*this);
  }

  void
  M480PrintVisitor::visit(const M480GetInstruction &i)
  {
    printTssRc(i,"get");
  }

  void
  M480PrintVisitor::printTssNoRc(const TssNoRcOpInstruction &i, const char *mnemonic)
  {
    getOutputStream() << mnemonic << " ";
    getOutputStream() << " ";
    i.getParOffset()->accept(*this);
    getOutputStream() << " ";
    i.getPosOffset()->accept(*this);
    getOutputStream() << " ";
    i.getTssFlags()->accept(*this);
  }
}
